#+TITLE:Biomass smoke events database 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

** TODO go manuscript run-able R
#+begin_src R :session *R* :tangle static/go_manuscript.R :exports none :padline no :eval yes 
  setwd("/home/ivan_hanigan/tools/web2py/applications/biomass_smoke_events_db/static/manuscript")
  library(knitr)
  library(knitcitations)
  library(rmarkdown)
  bookdown::render_book("index.Rmd", output_dir = "_book",
                        output_format = bookdown::html_chapters(split_by = "none"))
  file.rename("_main.html", "_book/main.html")
  #browseURL("_book/main.html")
  #setwd("../..")
#+end_src

#+RESULTS:
=TRUE
=** schematic
- tex 
- then 
cd ~/tools/web2py/applications/biomass_smoke_events_db/static/manuscript
convert -density 300  biosmoke_system_diagram.pdf biosmoke_system_diagram.png



